Autodesk.Revit.DB.ImageType.Unload
Unload the linked image.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ImageType is not a link.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this ImageType is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this ImageType is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this ImageType has no open transaction.
Since:
2021

Autodesk.Revit.DB.ImageType.ReloadFrom(Autodesk.Revit.DB.ImageTypeOptions)
Reloads the image in the ImageType from a new image file, and for a new Autodesk.Revit.DB.ImageType.PageNumber.
Remarks:
If reload fails (because the image file doesn't exist, cannot be read, or does not have the requested page number),
the currently loaded image will remain unchanged.
options:
Options that specify what image to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
options.Path is an empty string.
-or-
The file represented by options.Path is not a supported image file type.
-or-
The image file represented by options.Path is a password protected PDF file.
-or-
The image file represented by options.Path does not contain the page specified by options.PageNumber.
-or-
The image file represented by options.Path could not be read and may be corrupt.
-or-
An error occurred while handling the external resource corresponding to the image.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file represented by options.Path does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ImageType was not loaded from a file.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this ImageType is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this ImageType is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this ImageType has no open transaction.
Since:
2020

Autodesk.Revit.DB.ImageType.Reload
Reloads the ImageType from the file found at the location specified by the Autodesk.Revit.DB.ImageType.Path property,
using the same Autodesk.Revit.DB.ImageType.PageNumber and resolution.
Remarks:
If reload fails (because the image file doesn't exist, cannot be read, or does not have the correct page),
the currently loaded image will remain unchanged.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The file represented by Path does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ImageType was not loaded from a file.
-or-
The file represented by Path is not a supported image file type.
-or-
The image file represented by Path is a password protected PDF file.
-or-
The image file represented by Path does not contain the page specified by PageNumber.
-or-
The image file represented by Path could not be read and may be corrupt.
-or-
An error occurred while handling the external resource corresponding to the image.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this ImageType is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this ImageType is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this ImageType has no open transaction.
Since:
2015

Autodesk.Revit.DB.ImageType.CanReload
Check whether the ImageType can be reloaded from file.
Remarks:
The test first determines the candidate path for reloading the ImageType. Then the test checks that the
corresponding file is a valid image file, that it is unencrypted, and that it contains the page corresponding to Autodesk.Revit.DB.ImageType.PageNumber.
Returns:
True if the ImageType can be reloaded.  False, otherwise.
Since:
2020

Autodesk.Revit.DB.ImageType.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ImageTypeOptions)
Creates a new ImageType element and loads the image into it.
Remarks:
The ImageType will be created but will not be placed into any view.
document:
The document.
options:
Options that specify what image to load.
Returns:
The new ImageType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The image filename is an empty string.
-or-
The image file is not a supported image file type.
-or-
The image file is password protected.
-or-
The image file does not contain the requested page number.
-or-
The image file could not be read and may be corrupt.
-or-
An error occurred while handling the external resource corresponding to the image.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The image file does not exist.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2020

Autodesk.Revit.DB.ImageType.Resolution
The size of the pixels in the image, expressed in dots-per-inch (dpi)
Since:
2021

Autodesk.Revit.DB.ImageType.Height
The vertical size of the image
Since:
2021

Autodesk.Revit.DB.ImageType.Width
The horizontal size of the image
Since:
2021

Autodesk.Revit.DB.ImageType.Status
The status of the image
Since:
2021

Autodesk.Revit.DB.ImageType.Source
The source of the image in the ImageType.
Since:
2021

Autodesk.Revit.DB.ImageType.PathType
The path type that was used to refer to the file from which the ImageType was loaded.
Since:
2020

Autodesk.Revit.DB.ImageType.Path
The path to the file from which the ImageType was loaded.
Remarks:
The path string can be in one of several formats:
absolute local, relative local, or server (indicating that the file was provided by an external
server).  The format is determined by Autodesk.Revit.DB.ImageType.PathType
The path can be an empty string, for example for (but not limited to) ImageTypes created using
"Save to Project as Image".
Since:
2015

Autodesk.Revit.DB.ImageType.ExternalResourceType
The type of external resources that represents images.
Since:
2020

Autodesk.Revit.DB.ImageType.HeightInPixels
Number of pixels in the vertical direction of the image
Since:
2021

Autodesk.Revit.DB.ImageType.WidthInPixels
Number of pixels in the horizontal direction of the image
Since:
2021

Autodesk.Revit.DB.ImageType.PageNumber
The number of the page in a multi-page file, that was used to create the image in the ImageType.
Remarks:
This number is set when the ImageType is created or reloaded.
Since:
2020

Autodesk.Revit.DB.ImageType
Represents a type containing a raster based image. ImageInstances of this type can be placed in 2D views, sheets, and schedules.
Remarks:
ImageType elements are created with the ImageType.Create(Document, ImageTypeOptions) method.
ImageType elements can be loaded from the following file types: *.bmp, *.jpg, *.jpeg, *.png, *.tif.
In addition, when PDF support is available, ImageType elements can also be loaded from *.pdf files.
See: Autodesk.Revit.DB.OptionalFunctionalityUtils.IsPDFImportAvailable
Since:
2015